app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def all_articles
    @articles = Article.all

INSERT INTO "articles" ("location", "latitude", "longitude", "body", "date_traveled", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @article = current_user.articles.new(article_params)

    if @article.save