app/controllers/session_controller.rb

  def create
  user = User.find_by(email: user_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "barbararodriguezzamora@gmail.com"]]